In [2]:
"""
| id | name  |
| -- | ----- |
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |

| id | customerId |
| -- | ---------- |
| 1  | 3          |
| 2  | 1          |
"""

import pandas as pd

customers = [
    {"id": 1, "name": "Joe"},
    {"id": 2, "name": "Henry"},
    {"id": 3, "name": "Sam"},
    {"id": 4, "name": "Max"},
]

orders = [
    {"id": 1, "customerId": 3},
    {"id": 2, "customerId": 1},
]

customers = pd.DataFrame(customers)
orders = pd.DataFrame(orders)


customers["id"].isin(orders["customerId"])

0     True
1    False
2     True
3    False
Name: id, dtype: bool

In [3]:
"""
Views table:
+------------+-----------+-----------+------------+
| article_id | author_id | viewer_id | view_date  |
+------------+-----------+-----------+------------+
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |
+------------+-----------+-----------+------------+
"""

views = [
    {"article_id": 1, "author_id": 3, "viewer_id": 5, "view_date": "2019-08-01"},
    {"article_id": 1, "author_id": 3, "viewer_id": 6, "view_date": "2019-08-02"},
    {"article_id": 2, "author_id": 7, "viewer_id": 7, "view_date": "2019-08-01"},
    {"article_id": 2, "author_id": 7, "viewer_id": 6, "view_date": "2019-08-02"},
    {"article_id": 4, "author_id": 7, "viewer_id": 1, "view_date": "2019-07-22"},
    {"article_id": 3, "author_id": 4, "viewer_id": 4, "view_date": "2019-07-21"},
    {"article_id": 3, "author_id": 4, "viewer_id": 4, "view_date": "2019-07-21"},
]

views = pd.DataFrame(views)

# Find the authors who viewed at least one of their own articles
df = views[views["author_id"] == views["viewer_id"]][["author_id"]].reset_index(
    drop=True
)
df.drop_duplicates(inplace=True)
df.sort_values("author_id", inplace=True)
df

   author_id
1          4
0          7

In [4]:
"""
| tweet_id | content                           |
| -------- | --------------------------------- |
| 1        | Let us Code                       |
| 2        | More than fifteen chars are here! |
"""

tweets = [
    {"tweet_id": 1, "content": "Let us Code"},
    {"tweet_id": 2, "content": "More than fifteen chars are here!"},
]

tweets = pd.DataFrame(tweets)

tweets[tweets["content"].str.len() > 15][["tweet_id"]]

   tweet_id
1         2

In [5]:
"""
Employees table:
+-------------+---------+--------+
| employee_id | name    | salary |
+-------------+---------+--------+
| 2           | Meir    | 3000   |
| 3           | Michael | 3800   |
| 7           | Addilyn | 7400   |
| 8           | Juan    | 6100   |
| 9           | Kannon  | 7700   |
+-------------+---------+--------+
"""

employees = [
    {"employee_id": 2, "name": "Meir", "salary": 3000},
    {"employee_id": 3, "name": "Michael", "salary": 3800},
    {"employee_id": 7, "name": "Addilyn", "salary": 7400},
    {"employee_id": 8, "name": "Juan", "salary": 6100},
    {"employee_id": 9, "name": "Kannon", "salary": 7700},
]

employees = pd.DataFrame(employees)

employees.apply(
    lambda x: (x["salary"] if x["employee_id"] % 2 != 0 and x["name"][0] != "M" else 0),
    axis=1,
)

0       0
1       0
2    7400
3       0
4    7700
dtype: int64

In [6]:
"""
Iput: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
"""

employees = [
    {"id": 1, "salary": 100},
    {"id": 2, "salary": 200},
    {"id": 3, "salary": 300},
    {"id": 4, "salary": 200},
]
df = pd.DataFrame(employees)

df.sort_values("salary", ascending=False).reset_index(drop=True)
N = 2

df.iloc[N - 1][["salary"]].to_frame()

          1
salary  200

In [7]:
""">>> df = pd.DataFrame({'population': [59000000, 65000000, 434000,
...                                   434000, 434000, 337000, 11300,
...                                   11300, 11300],
...                    'GDP': [1937894, 2583560 , 12011, 4520, 12128,
...                            17036, 182, 38, 311],
...                    'alpha-2': ["IT", "FR", "MT", "MV", "BN",
...                                "IS", "NR", "TV", "AI"]},
...                   index=["Italy", "France", "Malta",
...                          "Maldives", "Brunei", "Iceland",
...                          "Nauru", "Tuvalu", "Anguilla"])
>>> df
          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI"""

df = pd.DataFrame(
    {
        "population": [
            59000000,
            65000000,
            434000,
            434000,
            434000,
            337000,
            11300,
            11300,
            11300,
        ],
        "GDP": [1937894, 2583560, 12011, 4520, 12128, 17036, 182, 38, 311],
        "alpha-2": ["IT", "FR", "MT", "MV", "BN", "IS", "NR", "TV", "AI"],
    },
    index=[
        "Italy",
        "France",
        "Malta",
        "Maldives",
        "Brunei",
        "Iceland",
        "Nauru",
        "Tuvalu",
        "Anguilla",
    ],
)

df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [8]:
df.sort_values("population", ascending=False)

          population      GDP alpha-2
France      65000000  2583560      FR
Italy       59000000  1937894      IT
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [9]:
dft = df.copy()


def test(df):
    # Will this change the original df?
    df = df.drop_duplicates(subset="population")
    return df


test(dft)


# No, it will not change the original df
# because the function is returning a new dataframe
dft.drop_duplicates(subset="population"), dft

(         population      GDP alpha-2
 Italy      59000000  1937894      IT
 France     65000000  2583560      FR
 Malta        434000    12011      MT
 Iceland      337000    17036      IS
 Nauru         11300      182      NR,
           population      GDP alpha-2
 Italy       59000000  1937894      IT
 France      65000000  2583560      FR
 Malta         434000    12011      MT
 Maldives      434000     4520      MV
 Brunei        434000    12128      BN
 Iceland       337000    17036      IS
 Nauru          11300      182      NR
 Tuvalu         11300       38      TV
 Anguilla       11300      311      AI)

In [10]:
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [11]:
# Local variables inside functions
# are not the same as the global variables
# even if they have the same name
# the function will not change the global variable

test = [1]


def test_mutation(test):
    test = test + [2]
    # Test does not change the global variable,
    # because it is a new object
    # and scoped to the function
    return test


test_mutation(test), test

([1, 2], [1])

In [12]:
import pandas as pd


def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    """Return the second highest salary of an employee.
    If there is no second highest salary, return null dataframe."""

    # Drop duplicates
    df = employee.drop_duplicates(subset=["salary"])["salary"]

    # Check if there is a second highest salary
    if len(df) < 2:
        return pd.DataFrame({"SecondHighestSalary": [None]})

    # Return the second highest salary
    second_highest_salary = df.nlargest(2).iloc[-1]

    return pd.DataFrame({"SecondHighestSalary": [second_highest_salary]})


employees = [
    {"id": 1, "salary": 100},
    {"id": 2, "salary": 200},
    {"id": 3, "salary": 300},
    {"id": 4, "salary": 200},
]

df = pd.DataFrame(employees)

df.drop_duplicates(subset=["salary"])["salary"].nlargest(2).iloc[-1]

np.int64(200)

In [ ]:
# Highest Departmenet Salaryimport pandas as pd


"""Find the employee with the highest salary in each department."""

"""
Input: 
Employee table:
+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Jim   | 90000  | 1            |
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
Department table:
+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
| 2  | Sales |
+----+-------+
Output: 
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Jim      | 90000  |
| Sales      | Henry    | 80000  |
| IT         | Max      | 90000  |
+------------+----------+--------+
"""
import pandas as pd

employee = [
    {"id": 1, "name": "Joe", "salary": 70000, "departmentId": 1},
    {"id": 2, "name": "Jim", "salary": 90000, "departmentId": 1},
    {"id": 3, "name": "Henry", "salary": 80000, "departmentId": 2},
    {"id": 4, "name": "Sam", "salary": 60000, "departmentId": 2},
    {"id": 5, "name": "Max", "salary": 90000, "departmentId": 1},
]

department = [
    {"id": 1, "name": "IT"},
    {"id": 2, "name": "Sales"},
]

employee = pd.DataFrame(employee)
department = pd.DataFrame(department)

# Check if the dataframes are empty
if employee.empty or department.empty:
    pd.DataFrame(columns=["Department", "Employee", "Salary"])

# Rename the columns to avoid ambiguity, id -> departmentId
department = department.rename(columns={"id": "departmentId", "name": "Department"})

# name -> Employee, salary -> Salary
employee = employee.rename(columns={"name": "Employee", "salary": "Salary"})

# Merge the two dataframes on departmentId
df = employee.merge(department, on="departmentId")

# Group by Department
df = df.groupby("departmentId")

# Select the employee with the highest salary in each department,
# including ties
df = df.apply(lambda x: x[x["Salary"] == x["Salary"].max()])

# Reset the index
df = df.reset_index(drop=True)

df[["Department", "Employee", "Salary"]]

/var/folders/r1/ggbq1z014sg_z5rdm9pr8mrr0000gn/T/ipykernel_72318/2525131960.py:70: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df = df.apply(lambda x: x[x["Salary"] == x["Salary"].max()])

  Department Employee  Salary
0         IT      Jim   90000
1         IT      Max   90000
2      Sales    Henry   80000

In [4]:
"""
Example 1:

Input: 
Scores table:
+----+-------+
| id | score |
+----+-------+
| 1  | 3.50  |
| 2  | 3.65  |
| 3  | 4.00  |
| 4  | 3.85  |
| 5  | 4.00  |
| 6  | 3.65  |
+----+-------+
Output: 
+-------+------+
| score | rank |
+-------+------+
| 4.00  | 1    |
| 4.00  | 1    |
| 3.85  | 2    |
| 3.65  | 3    |
| 3.65  | 3    |
| 3.50  | 4    |
+-------+------+
"""

import pandas as pd

scores = [
    {"id": 1, "score": 3.5},
    {"id": 2, "score": 3.65},
    {"id": 3, "score": 4.0},
    {"id": 4, "score": 3.85},
    {"id": 5, "score": 4.0},
    {"id": 6, "score": 3.65},
]

df = pd.DataFrame(scores)

df["rank"] = df["score"].rank(ascending=False, method="dense").astype(int)

df.sort_values("rank")

   id  score  rank
2   3   4.00     1
4   5   4.00     1
3   4   3.85     2
1   2   3.65     3
5   6   3.65     3
0   1   3.50     4

In [19]:
"""
| account_id | income |
| ---------- | ------ |
| 3          | 108939 |
| 2          | 12747  |
| 8          | 87709  |
| 6          | 91796  |
"""

import pandas as pd

df = pd.DataFrame({"account_id": [3, 2, 8, 6], "income": [108939, 12747, 87709, 91796]})

(df["income"] > 20000000).sum()

np.int64(0)